In [2]:
import pandas as pd 
import numpy as np 
import seaborn as sns

# Load the Tips dataset

In [3]:
df=pd.read_csv("tips.csv")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# Group by day and calculate the average tip amount

In [4]:
df.groupby("day").agg({"tip":"mean"})

           tip
day
Fri   2.734737
Sat   2.993103
Sun   3.255132
Thur  2.771452

# Calculate the total bill amount for each size of the group (number of people).

In [5]:
df.groupby("size").agg({"total_bill":"sum"})

      total_bill
size
1          28.97
2        2565.89
3         884.55
4        1058.70
5         150.34
6         139.32

# Calculate the average tip percentage (tip / total_bill * 100) for each day and time (lunch or dinner).

In [42]:
df["avg_tip_percent"]=(df["tip"]/df["total_bill"])*100

df.groupby(["day","time"]).agg({"avg_tip_percent":"mean"})

             avg_tip_percent
day  time
Fri  Dinner        15.891611
     Lunch         18.876489
Sat  Dinner        15.315172
Sun  Dinner        16.689729
Thur Dinner        15.974441
     Lunch         16.130074

# Find the maximum tip amount given by each gender.

In [43]:
df.groupby("sex").agg({"tip":"max"})

         tip
sex
Female   6.5
Male    10.0

# Calculate the total bill amount and tip amount for each day and size of the group.

In [64]:
df.groupby("day").agg({"total_bill":["sum","count"],"tip":"sum"})

     total_bill           tip
            sum count     sum
day
Fri      325.88    19   51.96
Sat     1778.40    87  260.40
Sun     1627.16    76  247.39
Thur    1096.33    62  171.83

# Calculate the average tip amount for each day, but only include data for groups of size 2 or more.

In [65]:
df.groupby(df[df["size"]>=2]["day"]).agg({"tip":"mean"})

           tip
day
Fri   2.780000
Sat   3.040000
Sun   3.255132
Thur  2.786885

# Find the day with the highest total bill amount, and calculate the average tip amount for that day.

In [88]:
#df.groupby("day").agg({"total_bill":"max","tip":"mean"})

display(df.groupby("day")["total_bill"].max().idxmax())

display(df[df["day"]==df.groupby("day")["total_bill"].max().idxmax()]["tip"].mean())

'Sat'

np.float64(2.993103448275862)

# Calculate the total bill amount for each day, but only include data for groups of size 3 or 4.

In [97]:
#f.groupby("day")["total_bill"].sum()

df.groupby(df[(df["size"]==3) | (df["size"]==4) ]["day"]).agg({"total_bill":"sum"})

      total_bill
day
Fri        56.15
Sat       847.56
Sun       813.15
Thur      226.39